---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.FieldId
source: html/c11c4781-9acd-baf9-692d-93bf4ab9c86e.htm
---
# Autodesk.Revit.DB.ScheduleFilter.FieldId Property

The ID of the field used to filter the schedule.

## Syntax (C#)
```csharp
public ScheduleFieldId FieldId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null